nxp-appcodehub/dm-lvgl-epaper-smartlabel-kw45/k32w148evk_wireless_uart_epaper_freertos/drivers/fsl_sfa.c
    mode = config->mode;

    /* Enable selected clock under test source. */
    base->CTRL_EXT |= SFA_CUT_CLK_Enable(config->cutSelect);

    /* Enable selected REF clock. */
    base->CTRL2 = (base->CTRL2 & ~SFA_CTRL2_REF_CLK_SEL_MASK) | SFA_CTRL2_REF_CLK_SEL(config->refSelect);

    if (config->enableCUTPin)
    {
#if defined(FSL_FEATURE_SFA_CTRL_EXT_HAS_CUT_PIN_EN) && FSL_FEATURE_SFA_CTRL_EXT_HAS_CUT_PIN_EN
        base->CTRL_EXT |= SFA_CTRL_EXT_CUT_PIN_EN_MASK;
#endif
        /*
         * $Branch Coverage Justification$
         * (1 != FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base)) not covered.
         * $ref sfa_c_ref_3$.
         */
        if (1 == FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base))
        {
            base->CTRL |= SFA_CTRL_CUT_PIN_EN_MASK;
        }
    }
    else
    {
#if defined(FSL_FEATURE_SFA_CTRL_EXT_HAS_CUT_PIN_EN) && FSL_FEATURE_SFA_CTRL_EXT_HAS_CUT_PIN_EN
        base->CTRL_EXT &= ~SFA_CTRL_EXT_CUT_PIN_EN_MASK;
#endif
        /*
         * $Branch Coverage Justification$
         * (1 != FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base)) not covered.
         * $ref sfa_c_ref_3$.
         */
        if (1 == FSL_FEATURE_SFA_CTRL_HAS_CUT_PIN_ENn(base))
        {
            base->CTRL &= ~SFA_CTRL_CUT_PIN_EN_MASK;
        }
    }

    /* Before modifying measurement basic options, disable SFA general enable signal. */
    base->CTRL &= ~SFA_CTRL_SFA_EN_MASK;
    switch (mode)
    {
        case kSFA_FrequencyMeasurement0:
        case kSFA_FrequencyMeasurement1:
        {
            base->CTRL =
                SFA_CTRL_MODE(config->mode) | SFA_CTRL_CUT_SEL(config->cutSelect) | SFA_CTRL_CUT_PREDIV(config->prediv);

#if defined(RF_SFA)
            /*
             * $Branch Coverage Justification$
             * (1U != FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base) not covered.
             * $ref sfa_c_ref_2$.
             */
            if (1 == FSL_FEATURE_SFA_INSTANCE_HAS_TRIGGERn(base))
            {
                /*
                 * $Line Coverage Justification$
                 * $ref sfa_c_ref_2$.
                 */
                if (config->enableTrigMeasurement)
                {
                    base->CTRL |= SFA_CTRL_SFA_TRIG_MEAS_EN_MASK;
                    base->CTRL |=
                        SFA_CTRL_TRIG_START_SEL(config->trigStart) | SFA_CTRL_TRIG_START_POL(config->startPolarity);
                }
                else
                {
                    base->CTRL &= ~SFA_CTRL_SFA_TRIG_MEAS_EN_MASK;
                }
            }
#endif
            base->CTRL |= SFA_CTRL_SFA_EN_MASK;

            SFA_SetCUTTargetCount(base, config->cutTarget);
            SFA_SetREFTargetCount(base, config->refTarget);
            break;
        }
        case kSFA_CUTPeriodMeasurement:
        {
            base->CTRL =
                SFA_CTRL_MODE(config->mode) | SFA_CTRL_CUT_SEL(config->cutSelect) | SFA_CTRL_CUT_PREDIV(config->prediv);

            base->CTRL |= SFA_CTRL_SFA_EN_MASK;

            SFA_SetREFTargetCount(base, config->refTarget);
            break;
        }
        case kSFA_TriggerBasedMeasurement:
        {
#if defined(RF_SFA)
            base->CTRL = SFA_CTRL_MODE(config->mode) | SFA_CTRL_TRIG_START_SEL(config->trigStart) |
                         SFA_CTRL_TRIG_START_POL(config->startPolarity) | SFA_CTRL_TRIG_END_SEL(config->trigEnd) |
                         SFA_CTRL_TRIG_END_POL(config->endPolarity);

            base->CTRL |= SFA_CTRL_SFA_EN_MASK;

            SFA_SetREFTargetCount(base, config->refTarget);
#endif
            break;
        }
        default:
            assert(false);
            break;
    }
}

/*!
 * brief Install the callback routine to be called when IRQ happens or measurement completes.
 *
 * param base SFA peripheral base address.
 * param function the SFA measure completed callback function.
 */
void SFA_InstallCallback(SFA_Type *base, sfa_callback_t function)
{
    assert(function);
    assert(1 == FSL_FEATURE_SFA_INSTANCE_HAS_INTERRUPTn(base));

    uint8_t instance;

    instance = SFA_GetInstance(base);
    if (s_sfaIsr[instance] == NULL)
    {
        s_sfaIsr[instance] = function;
    }
}

/*!
 * brief Start SFA measurement in blocking mode
 *
 * This function start SFA measurement based on the configged mode.
 * The user must config measure mode before invoking this function.
 * This function will return the measurement status until measure completes or timeout error happens.
 *
 * param base SFA peripheral base address.
 *
 * retval kStatus_SFA_MeasurementCompleted SFA measure completes.
 * retval kStatus_SFA_ReferenceCounterTimeout reference counter timeout error happens.
 * retval kStatus_SFA_CUTCounterTimeout CUT counter time out happens.
 */
status_t SFA_MeasureBlocking(SFA_Type *base)
{
    sfa_measurement_mode_t mode;
    status_t status = kStatus_Success;

    mode = (sfa_measurement_mode_t)SFA_GetMode(base);

    if (mode == kSFA_FrequencyMeasurement0 || mode == kSFA_FrequencyMeasurement1)
    {
        SFA_StartMeasureFrequency(base);
        status = SFA_MeasureFrequencyBlocking(base, mode);
    }
    /*
     * $Branch Coverage Justification$
     * $ref sfa_c_ref_5$.
     */
    else if (mode == kSFA_CUTPeriodMeasurement || mode == kSFA_TriggerBasedMeasurement)
    {
        SFA_StartMeasurePeriod(base);
        status = SFA_MeasurePeriodBlocking(base);
    }
    else
    {
        /* Add comments to prevent the case of MISRA C-2012 rule 15.7. */
    }

    return status;
}

/*!
 * brief Start measure sequence in NonBlocking mode.
 *
 * This function performs nonblocking measurement by enabling sfa interrupt (Please enable the FreqGreaterThanMax and
 * FreqLessThanMin interrupts individually as needed). The callback function must be installed before invoking this
 * function.
 * note This function has different functions for different instances.
 * param base SFA peripheral base address.
 */
void SFA_MeasureNonBlocking(SFA_Type *base)
{
    assert(1 == FSL_FEATURE_SFA_INSTANCE_HAS_INTERRUPTn(base));

    sfa_measurement_mode_t mode;

